# Brewfile - Mac Development Environment
# Generated: October 17, 2025
# Usage: brew bundle install

# Taps
tap "romkatv/powerlevel10k"

# Command Line Tools (Formulae)
brew "awscli"                # AWS Command Line Interface
brew "git"                   # Distributed version control system
brew "nvm"                   # Node Version Manager
brew "powerlevel10k"         # Zsh theme
brew "python@3.13"           # Python programming language
brew "wget"                  # Internet file retriever
brew "yarn"                  # JavaScript package manager
brew "zsh-autosuggestions"   # Fish-like autosuggestions for Zsh
brew "zsh-completions"       # Additional Zsh completions
brew "zsh-syntax-highlighting" # Fish-like syntax highlighting for Zsh

# GUI Applications (Casks)
cask "anaconda"              # Data science platform
cask "brave-browser"         # Privacy-focused web browser 
cask "firefox"               # Web browser
cask "caffeine"              # Prevent Mac from sleeping
cask "cursor"                # AI-powered code editor
cask "flow"                  # Task management app
cask "flux"                  # Screen color temperature adjuster
cask "font-meslo-lg-nerd-font"  # Nerd Font for terminal
cask "google-chrome"         # Web browser
cask "iterm2"                # Terminal emulator
cask "notion"                # Note-taking and collaboration
cask "pgadmin4"              # PostgreSQL admin tool
cask "postman"               # API development tool
cask "rectangle"             # Window management tool
cask "slack"                 # Team communication
cask "visual-studio-code"    # Code editor

