# Brewfile - Mac Development Environment
# Usage: brew bundle install

# ============================================================================
# Taps (Third-party Repositories)
# ============================================================================
tap "romkatv/powerlevel10k"

# ============================================================================
# Command Line Tools
# ============================================================================
brew "awscli"
brew "git"
brew "nvm"
brew "powerlevel10k"
brew "python@3.13"
brew "wget"
brew "yarn"

# Zsh Plugins
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# ============================================================================
# GUI Applications
# ============================================================================
# Browsers
cask "brave-browser"
cask "firefox"
cask "google-chrome"

# Code Editors
cask "cursor"
cask "visual-studio-code"

# Development Tools
cask "anaconda"
cask "iterm2"
cask "pgadmin4"
cask "postgres-unofficial"
cask "postman"

# Productivity
cask "caffeine"
cask "flow"
cask "flux"
cask "notion"
cask "rectangle"
cask "slack"

# Font
cask "font-meslo-lg-nerd-font"

